; domain
(define (domain frozen-lake)
  (:requirements :strips :typing)
  
  (:types
    location - object
  )
  
  (:predicates
    (at ?loc - location)
    (up ?from ?to - location)
    (down ?from ?to - location)
    (left ?from ?to - location)
    (right ?from ?to - location)
    (is-hole ?loc - location)
    (is-goal ?loc - location)
    (is-safe ?loc - location)

  )
  
    (:action move-up
        :parameters (?from ?to - location)
        :precondition (and 
            (at ?from)
            (up ?from ?to)
            (is-safe ?to)
        )
        :effect (and
            (not (at ?from))
            (at ?to)
        )
    )

    (:action move-down
        :parameters (?from ?to - location)
        :precondition (and 
            (at ?from)
            (down ?from ?to)
            (is-safe ?to)
        )
        :effect (and
            (not (at ?from))
            (at ?to)
        )
    )

    (:action move-left
        :parameters (?from ?to - location)
        :precondition (and 
            (at ?from)
            (left ?from ?to)
            (is-safe ?to)
        )
        :effect (and
            (not (at ?from))
            (at ?to)
        )
    )

    (:action move-right
        :parameters (?from ?to - location)
        :precondition (and 
            (at ?from)
            (right ?from ?to)
            (is-safe ?to)
        )
        :effect (and
            (not (at ?from))
            (at ?to)
        )
    )

)

; problem
(define (problem frozen-lake-4x4)
  (:domain frozen-lake)
  
  (:objects
    loc-0-0 loc-0-1 loc-0-2 loc-0-3
    loc-1-0 loc-1-1 loc-1-2 loc-1-3
    loc-2-0 loc-2-1 loc-2-2 loc-2-3
    loc-3-0 loc-3-1 loc-3-2 loc-3-3 - location
  )
  
  (:init
    ; Define the starting position
    (at loc-0-0)
    
    ; Define the goal
    (is-goal loc-3-3)
    
    ; Define the holes
    (is-hole loc-1-1)
    (is-hole loc-1-3)
    (is-hole loc-2-3)
    (is-hole loc-3-0)
    
    ; Define safe locations (all non-hole locations)
    (is-safe loc-0-0) (is-safe loc-0-1) (is-safe loc-0-2) (is-safe loc-0-3)
    (is-safe loc-1-0) (is-safe loc-1-2)
    (is-safe loc-2-0) (is-safe loc-2-1) (is-safe loc-2-2)
    (is-safe loc-3-1) (is-safe loc-3-2) (is-safe loc-3-3)
    
    ; Define directional relationships
    (up loc-1-0 loc-0-0) (down loc-0-0 loc-1-0)
    (up loc-1-1 loc-0-1) (down loc-0-1 loc-1-1)
    (up loc-1-2 loc-0-2) (down loc-0-2 loc-1-2)
    (up loc-1-3 loc-0-3) (down loc-0-3 loc-1-3)
    (up loc-2-0 loc-1-0) (down loc-1-0 loc-2-0)
    (up loc-2-1 loc-1-1) (down loc-1-1 loc-2-1)
    (up loc-2-2 loc-1-2) (down loc-1-2 loc-2-2)
    (up loc-2-3 loc-1-3) (down loc-1-3 loc-2-3)
    (up loc-3-0 loc-2-0) (down loc-2-0 loc-3-0)
    (up loc-3-1 loc-2-1) (down loc-2-1 loc-3-1)
    (up loc-3-2 loc-2-2) (down loc-2-2 loc-3-2)
    (up loc-3-3 loc-2-3) (down loc-2-3 loc-3-3)
    
    (left loc-0-1 loc-0-0) (right loc-0-0 loc-0-1)
    (left loc-0-2 loc-0-1) (right loc-0-1 loc-0-2)
    (left loc-0-3 loc-0-2) (right loc-0-2 loc-0-3)
    (left loc-1-1 loc-1-0) (right loc-1-0 loc-1-1)
    (left loc-1-2 loc-1-1) (right loc-1-1 loc-1-2)
    (left loc-1-3 loc-1-2) (right loc-1-2 loc-1-3)
    (left loc-2-1 loc-2-0) (right loc-2-0 loc-2-1)
    (left loc-2-2 loc-2-1) (right loc-2-1 loc-2-2)
    (left loc-2-3 loc-2-2) (right loc-2-2 loc-2-3)
    (left loc-3-1 loc-3-0) (right loc-3-0 loc-3-1)
    (left loc-3-2 loc-3-1) (right loc-3-1 loc-3-2)
    (left loc-3-3 loc-3-2) (right loc-3-2 loc-3-3)
  )
  
  (:goal (at loc-3-3))
)

; plan
1. (move-down loc-0-0 loc-1-0)
   deleted: (at loc-0-0)
   added: (at loc-1-0)
   goals met: 0 of 1
2. (move-down loc-1-0 loc-2-0)
   deleted: (at loc-1-0)
   added: (at loc-2-0)
   goals met: 0 of 1
3. (move-right loc-2-0 loc-2-1)
   deleted: (at loc-2-0)
   added: (at loc-2-1)
   goals met: 0 of 1
4. (move-down loc-2-1 loc-3-1)
   deleted: (at loc-2-1)
   added: (at loc-3-1)
   goals met: 0 of 1
5. (move-right loc-3-1 loc-3-2)
   deleted: (at loc-3-1)
   added: (at loc-3-2)
   goals met: 0 of 1
6. (move-right loc-3-2 loc-3-3)
   deleted: (at loc-3-2)
   added: (at loc-3-3)
   goals met: 1 of 1
